<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [

    // 使用复合缓存类型
    'type' => 'complex',
    // 默认使用的缓存
    'default' => [
        // 驱动方式
        'type' => 'File',
        // 缓存保存目录
        'path'   => '',
    ],
    // 文件缓存
    'file' => [
        // 驱动方式
        'type' => 'file',
        // 设置不同的缓存保存目录
        'path' => '../runtime/file/',
    ],

    // redis缓存
    'redis' => [
        'type' => 'redis',
        'host' => '127.0.0.1',
        // 全局缓存有效期（0为永久有效）
        'expire' => 0,
        // 缓存前缀
        'prefix' => 'think_',
    ],
];